import config from '../../config.cjs';

const ping = async (m, sock) => {
  const prefix = config.PREFIX;
const cmd = m.body.startsWith(prefix) ? m.body.slice(prefix.length).split(' ')[0].toLowerCase() : '';
const text = m.body.slice(prefix.length + cmd.length).trim();

  if (cmd === "menu") {
    const start = new Date().getTime();
    await m.React('✴️');
    const end = new Date().getTime();
    const responseTime = (end - start) / 1000;

    const text = `*❑━❒вσт ιηƒσямαтιση❑━❒*
- вσт ηαмє: ʝσєℓ-χ∂-ν3
- νєяѕιση 6.0.0
- σωηєя: ℓσя∂ ʝσєℓ 
- ѕтαтυѕ :вσт ιѕ σηℓιηє
- ρℓαтƒσям: ℓιηυχ
- мσ∂є: ρυвℓι¢
- ρяєƒιχ (.)
- тнємє: ʝσєℓ тє¢н
- ℓιвяαяу: вαιℓωαуѕ
*❑━❒ʝσєℓ χ∂ ν тняєє❑━❒*

---

*¢σηνєятєя*
- αттρ
- αттρ2
- αттρ3
- євιηαяу
- ∂вιηαяу
- ємσʝιмιχ
- мρ3

---

*αι*
- αι
- вυg
- яєρσят
- gρт
- ∂αℓℓє
- яємιηι
- gємιηι

---

*тσσℓ*
- ¢αℓ¢υℓαтσя
- тємρмαιℓ
- ¢нє¢кмαιℓ
- тят
- ттѕ

---

*gяσυρ ¢σммαη∂ѕ*
- ℓιηкgяσυρ
- ѕєтρρg¢
- ѕєтηαмє
- ѕєт∂єѕ¢
- gяσυρ
- g¢ѕєттιηg
- ωєℓ¢σмє
- α∂∂
- кι¢к
- нι∂єтαg
- тαgαℓℓ
- αηтιℓιηк
- αηтιтσχι¢
- ρяσмσтє
- ∂ємσтє
- gєтвισ

---

*∂σωηℓσα∂*
- αρк
- ƒα¢євσσк
- мє∂ιαƒιяє
- ριηтєяєѕт∂ℓ
- gιт¢ℓσηє
- g∂яινє
- ιηѕтα
- утмρ3
- утмρ4
- ρℓαу
- ѕσηg
- νι∂єσ
- утмρ3∂σ¢
- утмρ4∂σ¢
- тιктσк

---

*ѕєαя¢н*
- ρℓαу
- утѕ
- ιм∂в
- gσσgℓє
- gιмαgє
- ριηтєяєѕт
- ωαℓℓραρєя
- ωιкιмє∂ια
- утѕєαя¢н
- яιηgтσηє
- ℓуяι¢ѕ

---

*мαιη ¢σммαη∂ѕ*
- ριηg
- αℓινє
- σωηєя
- мєηυ
- ιηƒσвσт

---

*σωηєя ¢σммαη∂ѕ*
- ʝσιη
- ℓєανє
- вℓσ¢к
- υηвℓσ¢к
- ѕєтρρвσт
- αηтι¢αℓℓ
- ѕєтѕтαтυѕ
- ѕєтηαмєвσт
- αυтσтуριηg
- αℓωαуѕσηℓιηє
- αυтσяєα∂
- αυтσѕνιєω

---

*ѕтαℓкєя*
- тяυє¢αℓℓєя
- ιηѕтαѕтαℓк
- gιтнυвѕтαℓк

---

*❑━❒ℓσя∂ ʝσєℓтє¢н❑━❒*
╭───────────────━⊷
║ ᴊᴏᴇʟ-xᴍᴅ ᴍᴀɪɴ ʀᴇᴘᴏ
╰───────────────━⊷
╭───────────────━⊷
║💡 *ɴᴀᴍᴇ:* ᴊᴏᴇʟ-xᴍᴅ
║⭐ *ᴛᴏᴛᴀʟ sᴛᴀʀs:* 100
║🍴 *ᴛᴏᴛᴀʟ ғᴏʀᴋs:* 300
║👀 *ᴡᴀᴛᴄʜᴇʀs:* 2
║❗ *ᴏᴘᴇɴ ɪssᴜᴇs:* 2
║👤 *ᴏᴡɴᴇʀ:* ʟᴏʀᴅ ᴊᴏᴇʟ
╰───────────────━⊷
╭───────────────━⊷
║ sᴛᴀʀ ᴛʜᴇɴ ғᴏʀᴋ ᴍʏ ʀᴇᴘᴏ
║ ʀᴇᴘᴏ ʟɪɴᴋ: https://shorturl.at/MV98C
╰───────────────━⊷
 *ᴍᴀᴅᴇ ʙʏ ʟᴏʀᴅ ᴊᴏᴇʟ*`;
    sock.sendMessage(m.from, { text }, { quoted: m });
  }
}

export default ping;
